J0JIng/MDP-GRP13-2025/stm/STM32_MDP_Code/STM32_MDP_Code/Core/Src/app_motion.cpp
#include "app_motion.h"
#include "stm32f4xx_hal.h"
#include "cmsis_os2.h"
#include "main.h"
#include "app_main.h"
#include "pid.h"
#include "oled.h"
#include <cstdlib>
#include <cstdio>
#include <cstring>
#include <cmath>

namespace AppMotion {

	#define LEFT_ENCODER_SCALE 1.0
	#define RIGHT_ENCODER_SCALE 0.996  // adjust based on reference choice
	#define REAR_WHEEL_ROTATION_DISTANCE (3.142 * 6.5)
	#define ENCODER_PULSES_PER_WHEEL_ROTATION 780
	#define DISTANCE_PER_ENCODER_PULSE (REAR_WHEEL_ROTATION_DISTANCE / ENCODER_PULSES_PER_WHEEL_ROTATION)

// Simple file-scope yaw drift estimate (deg / sec). Updated slowly at runtime.
static float g_yaw_drift_bias_dps = 0.0f;

// Small helper: shortest angular difference (a - b) in degrees in range [-180,180]
static float angDiff(float a, float b) {
	float d = a - b;
	while (d > 180.0f) d -= 360.0f;
	while (d < -180.0f) d += 360.0f;
	return d;
}

	MotionController::MotionController(u_ctx *ctx) {
		this->ctx = ctx;
		/* Instantiate the physical devices */

	}

	void MotionController::start(void) {
		this->servo = new Servo(
			&htim12,
			TIM_CHANNEL_1,
			CENTER_POS_PWM - LEFT_DELTA,
			CENTER_POS_PWM + RIGHT_DELTA,
			CENTER_POS_PWM
		);


		this->lencoder = new Encoder(
			&htim2,
			TIM_CHANNEL_ALL
		);

		this->rencoder = new Encoder(
			&htim3,
			TIM_CHANNEL_ALL
		);

		this->lmotor = new Motor(
			&htim4,
			TIM_CHANNEL_3,
			TIM_CHANNEL_4,
			4500
		);

		this->rmotor = new Motor(
			&htim9,
			TIM_CHANNEL_1,
			TIM_CHANNEL_2,
			4500
		);

		// Edit the following to control the DC motor's PID.

		float pid_param_left[3] = {
			2.1,  //3.1 0.25
			0.0,
			0.1
		};


		float pid_param_right[3] = {
			3.1,  //3.1 0.35
			0.0,
			0.1
		};

		float pid_param_sync[3] = {
			0,
			0,
			0
		};

		PID_init(&this->left_pid, PID_POSITION, pid_param_left, 7000, 7000);
		PID_init(&this->right_pid, PID_POSITION, pid_param_right, 7000, 7000);

		PID_init(&this->sync_left_pid, 0, pid_param_sync, 1000, 1000);
		PID_init(&this->sync_right_pid, 0, pid_param_sync, 1000, 1000);
		emergency = false;

		instance_wrapper *wrapper_instance = new instance_wrapper();
		wrapper_instance->ctx = ctx;
		wrapper_instance->i = this;
		this->ctx->runner = osThreadNew(
				(osThreadFunc_t) MotionController::motionTask, wrapper_instance,
				&(ctx->attr));
		return;
	}

	/* MOTIONCONTROLLER LOGIC */
	void MotionController::motionTask(void *pv) {

		// workaround section START
		instance_wrapper *wrapper = static_cast<instance_wrapper*>(pv);
		u_ctx *ctx = wrapper->ctx;
		MotionController *self = wrapper->i;

		Motor *lmotor = self->lmotor;
		Motor *rmotor = self->rmotor;
		Servo *servo = self->servo;

//		servo->turnLeft();
//		servo->turnRight();
		servo->turnFront();
		osDelay(4500);

		/* workaround section END. henceforth refer to any "this" as "self" */


		for (;;) {
			is_task_alive_struct.motn = true;

//			HAL_GPIO_TogglePin(GPIOE, GPIO_PIN_8);

			osDelay(50);
			osThreadYield();

//          Uncomment the following code to make the robot move without the RPI
//          WARNING: This is just to test the robots movement, do not uncomment in production env.

			// Move straight 100 m
//			self->move(true, 100, 35, false, false);

//			osDelay(1000);

			// Move straight 100 m
//			self->move(false, 30, 35, false, false);

			// Turn right
//			self->move(true, 10, 35, false, false);
//			self->turn(true, true, false, 90);
//			osDelay(1000);
			//self->turn(true, false, false, 90);
//			self->move(true, 10, 35, false, false);

			// Turn left
//			self->move(true, 10, 35, false, false);
//			self->turn(false, true, false, 90); // fwd left
//			osDelay(1000);
//		    self->turn(false, false, false, 20);
//			self->move(true, 10, 35, false, false);
//			self->move(true, 10, 35, false, false);
//			self->turn(true, true, false, 90);
//			self->moveAndTurnAfterObstacle(false, true, false, 90);
//			self->move(false, 10, 35, false, false);
//			self->turn(false, true, false, 20);
			//self->move(true, 50, 35, false, false);
			//self->move(false, 50, 35, false, false);
//			self->turn(true, true, false, 90);
//			osDelay(4500);
//			self->move(true, 25, 35, false, false);
//			self->turn(true, true, false, 90);
//			osDelay(4500);
//			self->move(true, 25, 35, false, false);
//
//			osDelay(4500);
//			self->move(true, 25, 35, false, false);
//			osDelay(4500);
//			self->move(false, 50, 35, false, false);

//			self->move(true, 50, 35, false, false);
//			self->turn(true, true, false, 90);
//			self->move(false, 50, 35, false, false);
//			self->turn(true, true, false, 90);
			//self->moveAndTurnAfterObstacle(true, true, false, 90);

			//while(1){} // uncomment this code if you are using any of the test code above.

			if (osMessageQueueGetCount(ctx->mailbox.queue) > 0) {
				AppParser::MOTION_PKT_t pkt;
				osMessageQueueGet(ctx->mailbox.queue, &pkt, 0, 5);
				char buffer[20] = { 0 };
				sprintf((char*) &buffer, "cmd:%ld, arg:%ld\r\n", (uint32_t) pkt.cmd, pkt.arg);
				//HAL_UART_Transmit(&huart3, (uint8_t*) buffer, sizeof(buffer), 10);

				if (pkt.cmd == AppParser::MOTION_CMD::MOVE_FWD) {
					servo->turnFront();
					self->move(true, pkt.arg, 35, pkt.is_crawl, pkt.linear);

				} else if (pkt.cmd == AppParser::MOTION_CMD::MOVE_BWD) {
					servo->turnFront();
					self->move(false, pkt.arg, 35, pkt.is_crawl, pkt.linear);

				} else if (pkt.cmd == AppParser::MOTION_CMD::MOVE_LEFT_FWD) {
					self->turn(false, true, pkt.linear, pkt.arg);

				} else if (pkt.cmd == AppParser::MOTION_CMD::MOVE_RIGHT_FWD) {
					self->turn(true, true, pkt.linear, pkt.arg);

				} else if (pkt.cmd == AppParser::MOTION_CMD::MOVE_LEFT_BWD) {
					self->turn(false, false, pkt.linear, pkt.arg);

				} else if (pkt.cmd == AppParser::MOTION_CMD::MOVE_RIGHT_BWD){
					self->turn(true, false, pkt.linear, pkt.arg);
				}
				 else if (pkt.cmd == AppParser::MOTION_CMD::MOVE_FWD_UNTIL_LEFT_OBS){
					self->moveAndTurnAfterObstacle(false, true, pkt.linear, pkt.arg);
				}
				 else if (pkt.cmd == AppParser::MOTION_CMD::MOVE_FWD_UNTIL_RIGHT_OBS){
					self->moveAndTurnAfterObstacle(true , true, pkt.linear, pkt.arg);
				}
				 else if (pkt.cmd == AppParser::MOTION_CMD::MOVE_T2_O1){
					self->task2PassObstOne(pkt.turn_opt);
				}
				 else if (pkt.cmd == AppParser::MOTION_CMD::MOVE_T2_02){
					self->task2PassObstTwo(pkt.turn_opt);
				}
			}
		}
	}

	void MotionController::moveConstantPWM(bool isFwd, uint32_t speed, uint32_t duration_ms) {
	    emergency = false;
	    servo->turnFront();

