J0JIng/MDP-GRP13-2025/stm/STM32_MDP_Code/STM32_MDP_Code/Core/Src/app_motion.cpp
	    // Apply constant PWM
	    lmotor->setSpeed(speed, isFwd);
	    rmotor->setSpeed(speed, isFwd);

	    // Run for fixed time
	    uint32_t timeStart = HAL_GetTick();
	    while (HAL_GetTick() - timeStart < duration_ms) {
	        if (emergency) break;
	        osDelay(10);
	        osThreadYield();
	    }

	    // Stop motors
	    lmotor->halt();
	    rmotor->halt();
	}

	void MotionController::move(bool isFwd, uint32_t arg, uint32_t speed, bool isCrawl, bool nostop) {
		emergency = false;
		sensor_data.is_moving = true;
		servo->turnFront();
		osDelay(300);
		lmotor->setSpeed(speed, isFwd);
		rmotor->setSpeed(speed, isFwd);

		// Caution Manual override !!!!
		isCrawl = true;

		if (isCrawl)
		{
				lmotor->setSpeed(30, isFwd);
				rmotor->setSpeed(30, isFwd);
		}

		uint32_t dist_travelled = 0;
		uint32_t l_encoder_count = lencoder->getCount();
		uint32_t r_encoder_count = rencoder->getCount();
		double target = (double) arg / DISTANCE_PER_ENCODER_PULSE;

		if (!isFwd){
			target = target *2;
		}

		double cur_left = 0, cur_right = 0;
		float count_left = 0, count_right = 0;

		sensor_data.target = target;
		sensor_data.cur_left = cur_left;
		sensor_data.cur_right = cur_right;

//		 OLED_ShowString(0, 10, (uint8_t*)"Entered move()");
//		 OLED_Refresh_Gram();


		double speed_error = 0;
		// yaw correction helpers for this move
		bool _move_yaw_init = false;
		float _move_start_yaw = 0.0f;
		uint32_t _move_start_time = 0;
		float _prev_yaw = 0.0f;
		uint32_t _prev_yaw_time = 0;

		do {

//    		OLED_ShowString(0, 20, (uint8_t*)"looping...");
//			OLED_Refresh_Gram();

			count_left = (double) lencoder->getDelta(l_encoder_count, lencoder->getCount());
			count_right = (double) rencoder->getDelta(r_encoder_count, rencoder->getCount());


			cur_left += count_left * LEFT_ENCODER_SCALE;
			cur_right += count_right * RIGHT_ENCODER_SCALE;
			// update baseline counts so getDelta() returns per-iteration delta (avoid cumulative double-counting)
			l_encoder_count = lencoder->getCount();
			r_encoder_count = rencoder->getCount();
			speed_error += (count_left - count_right);

			// --- YAW-BASED MICRO-STEERING CORRECTION ---
			// initialize reference yaw at start of move
			if (!_move_yaw_init) {
				_move_start_yaw = sensor_data.yaw_abs;
				_move_start_time = HAL_GetTick();
				_prev_yaw = sensor_data.yaw_abs;
				_prev_yaw_time = sensor_data.yaw_abs_time ? sensor_data.yaw_abs_time : _move_start_time;
				_move_yaw_init = true;
			}

			// estimate instantaneous yaw rate and update global bias estimator
			{
				uint32_t now_time = HAL_GetTick();
				float yaw_now = sensor_data.yaw_abs;
				float dt = (float)( (sensor_data.yaw_abs_time && _prev_yaw_time) ? (sensor_data.yaw_abs_time - _prev_yaw_time) : (now_time - _prev_yaw_time)) / 1000.0f;
				if (dt > 0.001f) {
					float inst_rate = angDiff(yaw_now, _prev_yaw) / dt; // deg/sec
					// very slow low-pass to estimate bias
					g_yaw_drift_bias_dps = (g_yaw_drift_bias_dps * 0.995f) + (inst_rate * 0.005f);
				}
				_prev_yaw = yaw_now;
				_prev_yaw_time = sensor_data.yaw_abs_time ? sensor_data.yaw_abs_time : now_time;
			}

			// compute yaw error relative to expected biased reference
			float elapsed_s = (float)(HAL_GetTick() - _move_start_time) / 1000.0f;
			float expected_bias = g_yaw_drift_bias_dps * elapsed_s;
			float ref_yaw = _move_start_yaw + expected_bias;
			float yaw_error = angDiff(sensor_data.yaw_abs, ref_yaw); // deg, positive means rotated LEFT from ref (user convention)

			// convert yaw error to small servo PWM offset
			const float SERVO_YAW_GAIN = 2.0f; // PWM counts per degree (tune on robot)
			// use SLIGHT_LEFT_DELTA and SLIGHT_RIGHT_DELTA as micro-adjust caps
			int32_t max_left = SLIGHT_LEFT_DELTA; // positive offset to left is negative PWM offset
			int32_t max_right = SLIGHT_RIGHT_DELTA; // positive offset to right is positive PWM offset
			int32_t pwm_offset = (int32_t)(yaw_error * SERVO_YAW_GAIN); // positive yaw (left) -> positive pwm_offset -> steer right to compensate
			// clamp by side-specific slight deltas
			if (pwm_offset > max_right) {
				if (isFwd){
				pwm_offset = max_right;
				}
				else {
				pwm_offset = -max_right;
				}
			}
			if (pwm_offset < -max_left){
				if (isFwd){
					pwm_offset = -max_left;
				}
				else {pwm_offset = max_left;}
			}
			uint32_t pwm_cmd = (uint32_t)((int32_t) CENTER_POS_PWM + pwm_offset);
			// apply micro-adjustment without long blocking


			if (isFwd){
				servo->turnToPos(pwm_cmd);
			}


			if (!isCrawl && !nostop) {

				// Close to target check
				if (cur_left > target - 2000 || cur_right > target - 2000) {


					float pid_left = map(target - cur_left, 2000, 330, 35, 15);
					float pid_right = map(target - cur_left, 2000, 330, 35, 15);

					lmotor->setSpeed(pid_left, isFwd);
					rmotor->setSpeed(pid_right, isFwd);

				}

				// Use PID
				else {

					float pid_left = PID_calc(&this->left_pid, target - cur_left, target);
					float pid_right = PID_calc(&this->right_pid, target - cur_right, target);
					float pid_left_d = PID_calc(&this->sync_left_pid, speed_error, 0);
					float pid_right_d = PID_calc(&this->sync_right_pid, -speed_error, 0);

					// Update the speed
					lmotor->_setDutyCycleVal((uint32_t) ((pid_left + pid_left_d) > 1000 ?(pid_left + pid_left_d) : 1000), isFwd);
					rmotor->_setDutyCycleVal((uint32_t) ((pid_right + pid_right_d) > 1000 ?(pid_right + pid_right_d) : 1000), isFwd);
				}
			}

			l_encoder_count = lencoder->getCount();
			r_encoder_count = rencoder->getCount();
			dist_travelled = (uint32_t) (cur_left>cur_right?cur_right:cur_left) * DISTANCE_PER_ENCODER_PULSE;
			sensor_data.last_halt_val = dist_travelled;

			if ((cur_left > target && cur_right > target) || emergency)
			{
				sensor_data.last_halt_val = (uint32_t) (cur_left>cur_right?cur_right:cur_left) * DISTANCE_PER_ENCODER_PULSE;
				sensor_data.cur_left = cur_left;
				sensor_data.cur_right = cur_right;
				lmotor->halt();
				rmotor->halt();
				break;
			}

			osDelay(10);
			sensor_data.cur_left = cur_left;
			sensor_data.cur_right = cur_right;
//			char buf[50];
//			snprintf(buf, sizeof(buf), "L:%3.2f R:%3.2f T:%3.2f", cur_left, cur_right, target);
//			OLED_ShowString(0, 30, (uint8_t*)buf);
//			OLED_Refresh_Gram();
			osThreadYield();

		} while (1);


		lmotor->halt();
		rmotor->halt();
		emergency = false;
		sensor_data.is_moving = false;
	}

	void MotionController::turn(bool isRight, bool isFwd, bool arc, uint32_t arg) {
		sensor_data.is_moving = true;
		emergency = false;

		// LAST MINUTE CHANGE
//		if (!isRight && !isFwd ){
//			MotionController::move(false, 5, 100,true, false);
//		    sensor_data.is_moving = true;
//		}
//
//		if (isRight && !isFwd ){
//			MotionController::move(false, 5, 100,true, false);
//		    sensor_data.is_moving = true;
//		}

