J0JIng/MDP-GRP13-2025/stm/STM32_MDP_Code/STM32_MDP_Code/Core/Src/app_motion.cpp
		isRight ? servo->turnRight() : servo->turnLeft();
		isRight ? lmotor->setSpeed(51, isFwd) : lmotor->setSpeed(20, isFwd);
		isRight ? rmotor->setSpeed(20, isFwd) : rmotor->setSpeed(51, isFwd);

		if(arc) // arc increases turn radius
		{
			isRight ? lmotor->setSpeed(55, isFwd) : lmotor->setSpeed(20, isFwd);
			isRight ? rmotor->setSpeed(20, isFwd) : rmotor->setSpeed(55, isFwd);
		}
		uint32_t timeNow = HAL_GetTick();
		uint32_t timeStart = timeNow;
		uint8_t buf[30] = { 0 };
		float target_yaw = 0;
		float req = ((float) arg) ;
		float cur = sensor_data.yaw_abs; //[-179,180]
		float prev_yaw = cur;
		float last_target_dist = 99999.0f; // overshoot protection
		float bwd_diffn_delta = 0;

		if((!isRight && isFwd) || (isRight && !isFwd) ) //increase
		{
			if((req + cur) > 179) target_yaw = -180 + (req - (180 - cur));
			else target_yaw = req + cur;
		}
		else
		{
			if((cur - req) < -179) target_yaw = 180 - (req + (-180 - cur));
			else target_yaw = cur - req;
		}

		do{
			if (abs(target_yaw - cur) < 45 ) {
				if(isRight) lmotor->setSpeed((uint32_t)map(abs(target_yaw - cur), 45, 0, 30, 15), isFwd);

				else rmotor->setSpeed((uint32_t)map(abs(target_yaw - cur), 45, 0, 30, 15), isFwd);
			}
			else if(fmod(abs(abs(target_yaw) - abs(cur)), 180) < 45 )
			{
				if(isRight) lmotor->setSpeed((uint32_t)map(fmod(abs(abs(target_yaw) - abs(cur)), 180), 45, 0, 30, 15), isFwd);

				else rmotor->setSpeed((uint32_t)map(fmod(abs(abs(target_yaw) - abs(cur)), 180), 45, 0, 30, 15), isFwd);
			}

			timeNow = HAL_GetTick();
			/* Use backward differentiation algorithm here to estimate the current yaw based on time
			 * elapsed since last sample.
			 * Attempting to increase the gyro sample rate is worse because the drift errors pile up.
			 * Since we dont want to measure changes in sgn(cur - prev yaw) anyway, this method seems fine.
			 *
			 * abs(sensor_data.yaw_abs - sensor_data.yaw_abs_prev) is STEP SIZE
			 * 50 is TIME PER STEP
			 * sgn(sensor_data.yaw_abs - sensor_data.yaw_abs_prev) is DIRECTION
			 *
			 * */
			if(timeNow != sensor_data.yaw_abs_time)
				bwd_diffn_delta = abs(sensor_data.yaw_abs - sensor_data.yaw_abs_prev) * (float)(abs(timeNow - sensor_data.yaw_abs_time)/80);
			else
				bwd_diffn_delta = 0;
			cur = sensor_data.yaw_abs +  (bwd_diffn_delta * sgn(sensor_data.yaw_abs - sensor_data.yaw_abs_prev)); // already dlpf and qtn filtered
			sensor_data.yaw_cur_dbg = cur;
			prev_yaw = cur;
			//break off immediately if overshoot
			if (last_target_dist < abs(target_yaw - cur) && abs(target_yaw - cur) < 15) {
				lmotor->halt();
				rmotor->halt();
				break;
			}
			else last_target_dist = abs(target_yaw - cur);

			if (abs(target_yaw - cur) <= 0.375 || (abs(target_yaw - cur) <= 1.5 && arc) || (HAL_GetTick() - timeStart) > 10000)
			{
				sensor_data.last_halt_val = ((uint32_t)abs(target_yaw - cur)) %180;
				lmotor->halt();
				rmotor->halt();
				break;
			}

			sensor_data.last_halt_val = arg;
			osDelay(2);
			osThreadYield(); // need to ensure yield for the sensortask

		} while (1);


		// LAST MINUTE CHANGE
//		if (!isRight && isFwd){
//			MotionController::move(true, 5, 100, true, false);
// 		    sensor_data.is_moving = true;
//		}
//
//		if (isRight && isFwd){
//			MotionController::move(true, 5, 100, true, false);
// 		    sensor_data.is_moving = true;
//		}

		lmotor->halt();
		rmotor->halt();
		emergency = false;
		sensor_data.is_moving = false;
	}

	void MotionController::moveAndTurnAfterObstacle(bool isRight, bool isFwd, bool arc, uint32_t arg) {
		sensor_data.is_moving = true;
		emergency = false;
		float ir_threshold = 20.0f;
		sensor_data.last_halt_val = 0;

		servo->turnFront();
			osDelay(400);

		uint32_t dist_travelled = 0;
		uint32_t l_encoder_count = lencoder->getCount();
		uint32_t r_encoder_count = rencoder->getCount();
		double target = (double) arg / DISTANCE_PER_ENCODER_PULSE;

		double cur_left = 0, cur_right = 0;
		float count_left = 0, count_right = 0;

		sensor_data.target = target;
		sensor_data.cur_left = cur_left;
		sensor_data.cur_right = cur_right;


		double speed_error = 0;
		// yaw correction helpers for this move
		bool _move_yaw_init = false;
		float _move_start_yaw = 0.0f;
		uint32_t _move_start_time = 0;
		float _prev_yaw = 0.0f;
		uint32_t _prev_yaw_time = 0;

		lmotor->setSpeed(20, isFwd);
		rmotor->setSpeed(20, isFwd);

		do {

			count_left = (double) lencoder->getDelta(l_encoder_count, lencoder->getCount());
			count_right = (double) rencoder->getDelta(r_encoder_count, rencoder->getCount());


			cur_left += count_left * LEFT_ENCODER_SCALE;
			cur_right += count_right * RIGHT_ENCODER_SCALE;
			// update baseline counts so getDelta() returns per-iteration delta (avoid cumulative double-counting)
			l_encoder_count = lencoder->getCount();
			r_encoder_count = rencoder->getCount();
			speed_error += (count_left - count_right);

			// --- YAW-BASED MICRO-STEERING CORRECTION ---
			// initialize reference yaw at start of move
			if (!_move_yaw_init) {
				_move_start_yaw = sensor_data.yaw_abs;
				_move_start_time = HAL_GetTick();
				_prev_yaw = sensor_data.yaw_abs;
				_prev_yaw_time = sensor_data.yaw_abs_time ? sensor_data.yaw_abs_time : _move_start_time;
				_move_yaw_init = true;
			}

			// estimate instantaneous yaw rate and update global bias estimator
			{
				uint32_t now_time = HAL_GetTick();
				float yaw_now = sensor_data.yaw_abs;
				float dt = (float)( (sensor_data.yaw_abs_time && _prev_yaw_time) ? (sensor_data.yaw_abs_time - _prev_yaw_time) : (now_time - _prev_yaw_time)) / 1000.0f;
				if (dt > 0.001f) {
					float inst_rate = angDiff(yaw_now, _prev_yaw) / dt; // deg/sec
					// very slow low-pass to estimate bias
					g_yaw_drift_bias_dps = (g_yaw_drift_bias_dps * 0.995f) + (inst_rate * 0.005f);
				}
				_prev_yaw = yaw_now;
				_prev_yaw_time = sensor_data.yaw_abs_time ? sensor_data.yaw_abs_time : now_time;
			}

			// compute yaw error relative to expected biased reference
			float elapsed_s = (float)(HAL_GetTick() - _move_start_time) / 1000.0f;
			float expected_bias = g_yaw_drift_bias_dps * elapsed_s;
			float ref_yaw = _move_start_yaw + expected_bias;
			float yaw_error = angDiff(sensor_data.yaw_abs, ref_yaw); // deg, positive means rotated LEFT from ref (user convention)

			// convert yaw error to small servo PWM offset
			const float SERVO_YAW_GAIN = 2.0f; // PWM counts per degree (tune on robot)
			// use SLIGHT_LEFT_DELTA and SLIGHT_RIGHT_DELTA as micro-adjust caps
			int32_t max_left = SLIGHT_LEFT_DELTA; // positive offset to left is negative PWM offset
			int32_t max_right = SLIGHT_RIGHT_DELTA; // positive offset to right is positive PWM offset
			int32_t pwm_offset = (int32_t)(yaw_error * SERVO_YAW_GAIN); // positive yaw (left) -> positive pwm_offset -> steer right to compensate
			// clamp by side-specific slight deltas
			if (pwm_offset > max_right) {
				if (isFwd){
				pwm_offset = max_right;
				}
				else {
				pwm_offset = -max_right;
				}
			}
			if (pwm_offset < -max_left){
				if (isFwd){
					pwm_offset = -max_left;
				}
				else {pwm_offset = max_left;}
			}
			uint32_t pwm_cmd = (uint32_t)((int32_t) CENTER_POS_PWM + pwm_offset);
			// apply micro-adjustment without long blocking


			servo->turnToPos(pwm_cmd);


			l_encoder_count = lencoder->getCount();
			r_encoder_count = rencoder->getCount();
			dist_travelled = (uint32_t) (cur_left>cur_right?cur_right:cur_left) * DISTANCE_PER_ENCODER_PULSE;
			sensor_data.last_halt_val = dist_travelled;

